{
    "Book": {
        "Title": "Angelic and Demonic Magics",
        "Author": "Laplace the Second"
    }
}
//     "Foreword";
//     "I dedicate this book all magicians who, like me, has been lied to by the School of Magic. The fathers of Magic thought that the only magic that existed is the one that they wielded. We know today that their Magic is Elemental: a single branch of magic. I discovered there exists Angelic and Demonic magic. If more magic types exist, I will find them.");
//     "I was the first to use the chaotic and harmonious energies around us. Later, the possessed thought it was impossible to use more than one branch of magic, or to reverse what they named 'possession'. Some still doubt today that I even exist. If you doubt, come find me at my Dual School of Order&Chaos. I can dive deep into what idiots call possession and come back. They lose their humanities and become lower, almost like beasts.");
//     "Listen to me, if you wish to learn to use any kind of magic. I can use all magics. I will show you how.");


//     "Harmony and disorder";
//     "We swim in a sea of mixed chaos and order. Some days I feel like walking is like swimming through molasses, other times I feel I want to burn my house down out of rage. Sometimes, I feel inspired enough to write a book... You can feel this as the winds of magic blow through you. You don't know it, but your body does. It changes your mood, lifts your spirit or crushes your soul. If you listen to it, you can learn to feel the thickness and flow of the magic that surrounds you.");
//     "Everything we can see, we can also touch, move it around, or even destroy it. We can touch the things we see. Magic is the same. Before learning to touch it, you must see it. It is hard to find something in the dark, even in your own room. I doubt you could find anything in true darkness. Magic is exactly the same. You won't find it if you can't feel it. This is the first step.");
//     "When you can feel it, you will be able to see how it changes when you touch it, if it gets stronger or weaker. And after that maybe you can use it to kill someone... Or write spells that can be used by idiots.");
//     "This is why people think using angelic or demonic leads to possession. Spells make it too easy on stupid people. Reading a spell is much easier than forging it. No need to feel the flow of magic in you or around you. You can't know what demonic energy does to you if you can't feel it at all. And most 'possessed' can't. I have seen many people become possessed. You can feel the magic filling their body, way before you can see it with your eyes. Everything about them changes! Their angelic thoughts change their inner balance completely, dropping into a vicious circle. A large amount of inner Angelic energies encourage angelic thoughts. Angelic thoughts attract more angelic energy. Down, down, down it goes, until the person disappears inside the Angel.");
//     "Keep reading if you don't want this to happen to you.");

//     "Where does Magic live?";
//     "It's not hard to know where angelic or demonic wind accumulates. A cemetary. A castle, a church, a brothel. A fresh dug mass grave, a library, a drunkard's house... In all these places do angelic and demonic energies live. Maybe even in a person! You should make use of someone like that as much as possible. If you want to feel Elemental magic, go outside.");
//     "In a place where you know a lot of magic lives... Close to an object or person in which magic resides... Listen to your body, feel it in your guts, in your heart. Feel the winds change direction, the magic getting more or less thick. Your body can feel it, you just need to listen. It always flow through you and around you.");


//     "Feeling the magic";
//     "At first, you will need to focus to just be able to feel the magic. Don't worry, it's like a muscle. The more you use it, the stronger it gets. It helps to clear your thoughts, and to focus on your senses. Your smell, your taste, your hearing, the surrounding heat and cold, and especially your sense of balance. The feeling of magic is closely tied to your own sense of balance. Once you feel where down and up are, you will start feeling the magic energies around you.");
//     "Practice. It will become easy, almost natural. You'll be able to feel magic all the time, even while working or being focused on something else. Once you can feel the magic surrounding you, you can start taking notes on the general patterns. In this city, chaos reigns. You can even use this sense to feel major changes happening, before you can hear about them. This is also why mages flee castle towns days weeks or even months before a siege. Have you ever heard of many mages being stuck in a siege? No. You hear of how there are never enough mages in armies during a siege. This is the reason why.");
//     "This is also why even if you have no talent in magic, you should still learn to feel the magic. This is a very useful ability that everyone can learn. You can feel magic before you can hear, touch, or even see. Everyone benefits form feeling magic. It can be used in many ways.");


//     "Touching the magic";
//     "If you get bored of only feeling the magic, reach out and touch the magic. You can flap your arms like a chicken and make wind. Magic can be influenced by you exactly like that. Contrarily to wind though, magic is also influenced by your thoughts. The harder you focus, the more powerful your influence becomes.");
//     "Once you can feel and touch magic, you can force it to take shape in the physical world in ways that are useful to you. The classic example is the Angelic Light spear, which you can throw at demons to pierce their heart. Very useful! Very simple. Accessible to all. Practice making magic into many kinfs of useful shapes and sizes.");

//     "Casting spells.";
//     "Do not cast spells written by others. You can perfectly cast spells without them, of even create your own. That requires a deep understand of magic, which is difficult to get: hard work over many years of training. It will make you a better Mage. Spells can be recited by newborn idiots.");

//     "Writing magic spells.";
//     "Do not write magic spells.");
//     "Angelic, demonic or elemental. Do not write any magic spells!");
//     "Written spells can get in the hands of idiots. Spells in your mind can't be stolen or used by anyone else.");

//     "What is possession?";
//     "You can hear many magic users talk about possession. 'He became possessed by the demonic energies'. 'He turned into a demon and devoured her!' That is a horrible way to explain it. Demonic energies do not randomly concentrate themselves in a body. A human does not naturally get rid of almost all of it's harmonious and elemental energies. The people do it, and keep it that way. Whether they realize it or not, this is what they are doing.");
//     "The bodies of the 'possessed' are simply adjusting themselves to an incredible amount of demonic energies. A frail human body cannot contain so much ill will. Only the body of a Demon can. The 'possessed' are just transforming into Demons. Some people think it is slow. But it can take only only a few moments to become a Demon, if you are used to it. For novices, it might take weeks. Many poisons take much more time to kill you. Ills can take root for many years before risIng to the surface. But demonic energies act on the heart and body almost instantly.");


//     "Reverting possession";
//     "Stopping the transformation is rather simple. Magic energies normally fill up our bodies in balance. To stop the transformation, you must go back to your original point of balance. Finding places that are full of your missing energies and have a lack of your excesses can help with that.");
//     // Implicit-> need to feel all three types of magic + how to manipulate them willingly 3 types of magic! No wonder people fall into the trap of so-called possession. They can almost always willingly manipulate only one type of magic, at best.



//     "Transforming at will";
//     "It is easy to feel the balance in normal humans. It is also easy to notice Angels barely contain any demonic or elemental energy. To transform into a Demon, an Angel or an Elemental, you must destroy your internal magic balance. Or at least, accumulate enough magic for you to lean very hard in only one direction.");
//     "Your body will react quite quickly to dramatic changes. For your first time, you should unbalance yourself very slowly, in a couple hours. The more you practice, the shorter time it will take you to completely change from a 'possessed' to a full Demon, all the way back to human all over again.");
//     "Before diving, you should fully understand the original balance in you. And when you dive, make sure to Remember your balance. Remember your balance! The feel of it, the shape of it, it's flow and direction. That way, you will never be lost. Remember your balance! Even in the most demonic of places, incarnating the most evil Demon, remember your balance! Remember who you are! Only then will you be able to make your way back.");

//     "Creating new spells from nothing";
//     "I have been asked many times: 'How is there so many spells? Just use magic to kill people!'. This is wrong.");
//     "There are many weapons. All with the objective of hurting or killing people. Some cut, some crush, some stab, some increase your critical hit chance... Some are better at cutting then others. Some weapons are made to be thrown, some can be thrown but will not fly true. The same metal can be forged into completely different weapons by blacksmiths of different skill.");
//     "The same is true of magic. The strength of the spells depends not only on the skill of the caster, but on the spellforger. Nothing is easy. Spellcasting isn't easy and neither is spellforging. But both skills are required for a pupil to truly become a Mage.");
//     "I will not tell you how to spellforge. There is a way, but you should embark on it yourself. Maybe I will write a book on spellforging, for Mages that already started forging. For later.");


//     "From mage to sage.";
//     "Who knows how to where wisdom lives and how to acquire it? I did not find it at the School of Magic, even though they can teach you some very useful tricks. If any Mage finds a reliable source of Wisdom, tell me.");

//     "The Purpose of Magic";
//     "This book is a results of years of experimentation, of hard study and of asking questions to myself, people around me, even the trees and rivers. I have not yet found all my answers, but the Angelic and Demonic energies set my life on a new course of discovery. Now, I want to share my knowledge with as many people as possible.");
//     "Magic has a purpose, in this world. I do not understand it yet. And I wish to recruit you in my quest to discover the Purpose of Magic. Come find me, if you wish to help me on this quest. Everyone knows my name, now...");
