{
    "Book": {
        "Title": "Celestial Mathemagics",
        "Author": "Le marquis de Laplace",
        "Page": {
            "Title": "Introduction to Mathemagics",
            "Paragraph":  [
                "It is easy to see that this world is governed by randomness.",
                "Mages, soldiers and mathemagicians all realize this fact: nothing is certain.",
                "Taking but a single swing of a sword means to take a risk, to bet on your skills against your opponent's capacity to dodge."
            ],
            "Paragraph":  [
                "A novice enemy may very well carry the Goddess's favor and evade all attacks.",
                "While you dear reader no doubt skilled in the arts of war might only earn her scorn and receive a swift painful death at the point of a spear."
            ],
            "Paragraph":  [
                "Such is the, tapestry She weaves...", 
                "May She have mercy on us all.", 
                "Blasphemers say She is a capricious Goddess that Her judgements are cruel unfair and arbitrary.",
                "Those of weak faith may yet think something be wrong with Creation.",
                "Nay it is not so!", 
                "Nothing is arbitrary, the Heavenly tapestry is never woven carelessly.",
                "Rules guide randomness in service of the Creation Divine."
            ],
            "Paragraph":  [
                "Mathemagics is the study of the rules that underline chance.", 
                "We Mathemagicians believe that to fully understand the rules of randomness brings us closer to the Goddess.", 
                "We write, them all here so that the curious might benefit from ascending into the realm of arcane Mathemagics." 
            ]
        },
        "Page": {
            "Title": "The Cosmic Background Pseudo Random Number Generator (RNG)",
            "Paragraph":  [
                "All events in this world are decided by the Cosmic Background pseudo Random Number Generator (RNG).",
                "Each individual soldier's combat statistics such as a hit rate (%) are compared to the background RNG.",
                "If this rate is greater than the, next Random Number (RN) generated by the Cosmic RNG the hit will land.", 
                "The same applies to all other random events in this world. Any further questions about \"Pseudo\" random numbers are better left for the Metamathemagicians."
            ],
            "Paragraph":  [
                "The Cosmic RNG uses the divine Mersenne Twister Generator.", 
                "Deep are its mysteries!", 
                "The Generator's state was created at Genesis by the Most High Creators.", 
                "Its state is updated everytime a RN is generated.", 
                "Knowing the state of the divine Generator one can perfectly predict the will of the Goddess."
            ],
            "Paragraph":  [ 
                "As a Mathemagician, I strongly discourage inquiry into the internal state of the Cosmic RNG so as not as they say \"diminish Creation\"."
            ]
        },
        "Page": {
            "Title": "Details about the Cosmic RNG",
            "Paragraph":  [
                "Let us now take a moment to define important properties of the Cosmic RNG. We specifically wish to highlight two:"
            ],
            "Paragraph":  [
                "1-The random numbers are Discrete.", 
                "This means that the, numbers the Goddess gives are whole integers: 0, 1, 2... up to 99."
            ],
            "Paragraph":  [
                "2-The RNs are Uniform between 0 and 99.", 
                "This means that all, numbers between these bounds have equal likelihood to be ordained.", 
                "In the Cosmic RNG's case it means that all, numbers have an equal, 1/100, 1% chance of being anointed." 
            ]
        },
        "Page": {
            "Title": "Single and Double Roll",
            "Paragraph":  [
                "We mentionned that \"if the hit rate is greater than the next Random Number (RN), the hit will land\".",
                "That is only true if we live in a Single Roll world.",
                "In reality Creation is Double Roll.", 
                "So was ordained Above."
            ],
            "Paragraph":  [
                "In a Double Roll universe, two RNs are averaged together then compared to the Hit rate.",
                "If the hit rate is higher than the average of two RNs the hit lands.", 
                "The Goddess chose, the double Roll, for its simplicity and to reward the skillful."
            ],
            "Paragraph":  [
                "An unfortunate side-effect of this universal constant is that the less skilled are punished.", 
                "Above a hit rate of 50% Double Roll increase, the likelihood of a hit but under 50% decreases it instead.",
                "\"To everyone who has more shall be given; but from those who do not have everything shall be taken away.\""
            ]
        },
        "Page": {
            "Title": "No doubt this too was ordained by the RNG Goddess",
            "Paragraph":  [
                "In truth both peasants and aristocrats are rather mediocre at judging chance.", 
                "We all, naturally tend to overestimate high chance events and underestimate low chance events.", 
                "It may take years for a serious Mathemagician to get an intuitive grasp of chance. Some, never do. "
            ],
            "Paragraph":  [
                "Laymen mistakenly believe that regular patterns are random while random patterns are orderly!",
                "Those of little faith regularly cry out \"The RNG is busted!\" or \"What is going on? The RNG is broken!\" when witnessing events ordained by the Goddess."
            ],
            "Paragraph":  [
                "No unbeliever!", 
                "The Cosmic RNG is working just as Her Divine Will commands!", 
                "It is your lack of faith that makes you see order in the pseudo-chaos created by the Cosmic RNG.",
                "Divine is Her Will!", 
                "Final is Her Decision!"
            ]
        },
        "Page": {
            "Title": "Conclusion",
            "Paragraph":  [
                "Thank you for reading this book.", 
                "As the reader has no doubt realized this book is intented to anyone, that wish to deepen their gratitude, for creation.", 
                "We hope all readers can renew their fate in the Goddess' Tapestry through the shining light of Mathemagics."
            ]
        } 
    }
}
